[
  "Bananas are berries, but strawberries aren't.",
  "Octopuses have three hearts.",
  "Honey never spoils—edible honey has been found in ancient tombs.",
  "A day on Venus is longer than its year.",
  "There are more stars in the universe than grains of sand on all the world’s beaches.",
  "Wombat poop is cube-shaped.",
  "Hot water can freeze faster than cold water under certain conditions (the Mpemba effect).",
  "A group of flamingos is called a flamboyance.",
  "Scotland’s national animal is the unicorn.",
  "A single strand of spaghetti is called a spaghetto.",
  "Butterflies taste with their feet.",
  "Oxford University is older than the Aztec Empire.",
  "The Eiffel Tower can grow six inches taller in summer heat.",
  "Koalas sleep up to 22 hours a day.",
  "Cows moo in regional accents.",
  "Sharks have existed longer than trees.",
  "A bolt of lightning is five times hotter than the surface of the Sun.",
  "Wombats can run up to 40 km/h.",
  "The shortest war in history lasted 38 minutes.",
  "A sneeze travels at about 100 mph.",
  "Sea otters hold hands while sleeping so they don’t drift apart.",
  "Humans share 50 % of their DNA with bananas.",
  "Koalas have fingerprints almost identical to humans'.",
  "Cheetahs can accelerate from 0 to 100 km/h in just 3 seconds.",
  "Hummingbirds are the only birds that can fly backwards.",
  "A crocodile cannot stick its tongue out.",
  "Bananas glow blue under ultraviolet light.",
  "The human nose can detect over 1 trillion different scents.",
  "There is enough DNA in an average person’s body to stretch from the Sun to Pluto and back.",
  "A group of jellyfish is called a smack.",
  "Sloths can hold their breath for up to 40 minutes.",
  "Sea cucumbers defend themselves by expelling their own organs.",
  "Ketchup was once sold as medicine.",
  "The world’s oldest recorded “your mom” joke is 3 800 years old.",
  "The inventor of the microwave oven received only $2 for his discovery.",
  "A day on Mercury lasts 59 Earth days.",
  "Turritopsis dohrnii, a jellyfish species, can revert to its juvenile form—effectively immortal.",
  "Some turtles breathe through their butts.",
  "A group of frogs is called an army.",
  "Cockroaches can live for weeks without their heads.",
  "The electric chair was invented by a dentist.",
  "An ostrich’s eye is bigger than its brain.",
  "Sound travels faster in water than in air.",
  "Sea otters have a favorite rock they use to crack shells.",
  "A rhinoceros’s horn is made of keratin, the same substance in our hair and nails.",
  "Parrots can live for over 80 years.",
  "The world’s largest flower, Rafflesia arnoldii, can grow over 3 feet across.",
  "Some fungi can zombify insects and control their behavior.",
  "Humans are the only animals that blush.",
  "A narwhal’s tusk reveals its age and health history.",
  "The driest place on Earth is Antarctica’s Dry Valleys.",
  "Butterflies can see ultraviolet patterns on flowers.",
  "Venus rotates so slowly that its day is longer than its year.",
  "A group of crows is called a murder.",
  "Mosquitoes are more attracted to people who just ate bananas.",
  "The inventor of the Pringles can is buried in one.",
  "Tigers have striped skin, not just striped fur.",
  "Bamboo can grow nearly 1 meter per day.",
  "The inventor of Vaseline ate a spoonful of it every morning.",
  "Your nose can remember 50 000 different scents.",
  "Cats have fewer toes on their back paws than their front paws.",
  "A group of hedgehogs is called an array.",
  "The world’s largest snowflake on record was 15 inches wide.",
  "You burn more calories sleeping than watching TV.",
  "Elephants are the only mammals that can’t jump.",
  "Pineapple is actually multiple berries fused together.",
  "Sea slugs can steal chloroplasts from algae and photosynthesize.",
  "Owls can rotate their heads up to 270°.",
  "Chocolate was once used as currency.",
  "The Great Wall of China is not visible from space without aid.",
  "A group of kangaroos is called a mob.",
  "Hot water can sometimes freeze faster than cold water.",
  "The majority of your brain is fat—about 60 %.",
  "The Sun accounts for 99.86 % of the Solar System’s mass.",
  "Jupiter’s Great Red Spot is a storm twice the size of Earth.",
  "There are more trees on Earth than stars in the Milky Way.",
  "A snail can sleep for three years.",
  "Flamingos get their pink color from their diet of shrimp.",
  "The adult human body has about 7 octillion atoms.",
  "A cube of neutron star material would weigh around 6 billion tons.",
  "Otters hold hands so they don’t drift apart in water.",
  "The Eiffel Tower sways up to 18 cm in strong wind.",
  "A full head of human hair weighs about 0.44 kg.",
  "Venus spins backwards, so the Sun rises in the west there.",
  "Dolphins have unique names for each other.",
  "A lobster’s blood is naturally blue.",
  "There are more fake flamingos in the world than real ones.",
  "A group of flamingos is also called a stand or a flamboyance.",
  "Some mushrooms can glow in the dark.",
  "A bolt of lightning can reach 30 000 °C—five times hotter than the Sun’s surface.",
  "Wombat feces are cube-shaped to prevent them from rolling away.",
  "The unicorn is Scotland’s national animal.",
  "Bees can recognize human faces.",
  "A day on Pluto lasts about 153 hours.",
  "Male seahorses get pregnant and give birth.",
  "Sharks existed before trees evolved.",
  "Hippos produce a natural sunscreen that is red-colored.",
  "A group of porcupines is called a prickle.",
  "Polar bear fur is actually transparent, not white.",
  "The shortest commercial flight in the world lasts only 57 seconds.",
  "Sharks are immune to most diseases, including cancer.",
  "Venus spins in the opposite direction of most planets.",
  "There are more lifeforms living on your skin than there are people on Earth.",
  "A flamingo can only eat when its head is upside down.",
  "The inventor of the Rubik’s Cube was a Hungarian architect.",
  "The world’s largest grand piano was built by a 15-year-old in New Zealand.",
  "A single strand of human hair can hold about 100 grams.",
  "Some plants can eat mice and insects to survive in poor soils.",
  "Giant Pacific octopuses have been observed using tools.",
  "The word “robot” comes from a Czech word meaning “forced labor.”",
  "Banging your head against a wall burns 150 calories an hour (not recommended!).",
  "Sea dragons are mesmerizing relatives of seahorses.",
  "Armadillos always give birth to genetically identical quadruplets.",
  "The first album ever played in space was by The Beatles.",
  "Pilots sometimes prefer to park near dark-liveried aircraft at night to avoid glare.",
  "Some turtles breathe through their butts for hours under water.",
  "A cockroach can live for more than two weeks without its head.",
  "The world’s oldest piece of chewing gum is over 9,000 years old.",
  "A hummingbird’s heart can beat as many as 1,260 times per minute.",
  "The average cloud weighs about 1.1 million pounds.",
  "Venus is the hottest planet in our solar system, despite Mercury being closer to the Sun.",
  "Bees have five eyes: three simple eyes on top of their head and two large compound eyes.",
  "An ant can lift up to 50 times its own body weight.",
  "Cats have over 20 muscles that control their ears.",
  "Some bamboo species can grow nearly 1 meter in a single day.",
  "An adult human has about 206 bones, but a baby is born with around 300.",
  "Electric eels can generate an electric shock of up to 600 volts.",
  "Pine trees are some of the oldest living organisms, with ages exceeding 5,000 years.",
  "A group of unicorns is called a blessing.",
  "Cows have best friends and get stressed when separated from them.",
  "Hot-pepper heat is measured in Scoville Heat Units.",
  "A leopard’s spots are called rosettes because of their rose-like appearance.",
  "Some fungi use chemicals that zombify insects and control their behavior.",
  "Chimpanzees share about 98 % of their DNA with humans.",
  "The Earth’s core is as hot as the surface of the Sun.",
  "A blue whale’s tongue can weigh as much as an elephant.",
  "Orangutans share about 97 % of our DNA.",
  "Squirrels plant thousands of new trees each year simply by forgetting where they buried their nuts.",
  "The inventor of the safety pin received the first US patent for it in 1849.",
  "Reindeer eyes change color through the seasons for better night vision.",
  "A day on Neptune lasts just 16 hours.",
  "One teaspoon of neutron-star material would weigh about 6 billion tons on Earth.",
  "The longest place name (85 letters) is in New Zealand: Taumata­whakatangihanga­koauau­o Tamatea­turipukaka­pikimaunga horonuku pokai whenuakitanatahu.",
  "Frogs absorb water through their skin rather than drinking it.",
  "Pluto’s heart-shaped region is officially named Tombaugh Regio.",
  "Jupiter’s magnetic field is 14 times stronger than Earth’s.",
  "A group of ferrets is called a business.",
  "Reindeer have endpoint-shaped hooves that act like snowshoes.",
  "The world’s smallest reptile is a nano-chameleon discovered in 2021.",
  "Bananas are naturally radioactive due to their potassium content.",
  "Wombat cubs are the size of jellybeans at birth.",
  "A group of pandas is called an embarrassment.",
  "Rainbows are actually full circles—Earth’s surface cuts off the bottom half.",
  "A bolt of lightning contains enough energy to toast 100,000 slices of bread.",
  "The first computer mouse was made of wood.",
  "Jellyfish can clone themselves through a process called budding.",
  "Chocolate was once used as currency in ancient cultures.",
  "A lion’s roar can be heard from up to 8 kilometers away.",
  "Alaska is the only US state that is simultaneously in the western, northern, and eastern hemispheres.",
  "Wombats can sprint up to 40 km/h for short bursts.",
  "Bananas glow blue under ultraviolet light.",
  "Some mushrooms produce glowing light in the dark.",
  "A bolt of lightning can reach temperatures of 30,000 °C.",
  "Polar bears have black skin underneath their white fur.",
  "The world’s largest flower, Rafflesia arnoldii, smells like rotting flesh.",
  "Orcas (killer whales) are actually part of the dolphin family.",
  "A newborn kangaroo is about 2 cm long—smaller than a paperclip.",
  "The atomic number of the element named after Einstein (einsteinium) is 99.",
  "Dolphins sleep with one half of their brain awake at a time.",
  "A snail’s mouth has thousands of tiny teeth.",
  "Saturn’s rings are made mostly of ice and rock fragments.",
  "The driest non-polar desert is the Atacama Desert in Chile.",
  "Starfish can regenerate entire limbs and sometimes their whole body.",
  "The first animal to orbit the Earth was a dog named Laika aboard Sputnik 2.",
  "Snails can sleep for up to three years during droughts.",
  "Bees can recognize human faces in tests similar to those used on humans.",
  "The nociceptor architectural proteins also give snails their slime adhesive.",
  "The human heart creates enough pressure to squirt blood up to 30 feet.",
  "Camels have three eyelids to protect against sandstorms.",
  "Sharks are older than dinosaurs—over 400 million years old.",
  "Octopuses have blue blood and nine brains.",
  "A snail can crawl over 200 times its own length in a day.",
  "Some fish, like the climbing perch, can travel on land for short distances.",
  "The Sahara Desert was once a lush, green forest.",
  "Scallops have up to 200 simple eyes lining their shells.",
  "A giraffe’s tongue is about 45 cm long.",
  "Your brain accounts for about 2% of your body weight but uses about 20% of your body’s energy.",
  "Wearing headphones for just an hour can increase the bacteria in your ears by 700 times.",
  "The human body glows in the dark, but the light is too weak for the naked eye to see.",
  "Cleopatra was not Egyptian but of Greek Macedonian descent.",
  "Sharks can live for up to 500 years—the Greenland shark holds the record.",
  "The fingerprints of koalas are so close to humans’ that they have occasionally been confused at crime scenes.",
  "The world’s largest desert is Antarctica—it’s classified as a cold desert.",
  "A day on Jupiter is just under 10 Earth hours long.",
  "A group of peacocks is called an ostentation.",
  "Polar bear fur is actually transparent, not white.",
  "A bolt of lightning weighs about five pounds.",
  "Cleopatra lived closer in time to the first iPhone release than to the building of the Great Pyramid.",
  "The world’s smallest reptile is a chameleon that can perch on the tip of a finger.",
  "Bananas are naturally radioactive due to their potassium content.",
  "Some bamboo species can grow nearly 1 meter in a single day.",
  "A newborn kangaroo is about 2 cm long—smaller than a paperclip.",
  "You share more DNA with a banana than you do with a cucumber.",
  "A snail can sleep for up to three years under certain conditions.",
  "Dolphins have been observed using tools like sponges to protect their snouts.",
  "The Sahara Desert moves about 0.8 km to the south each year.",
  "A group of flamingos is also called a stand or a flamboyance.",
  "Venus is the only planet that spins clockwise on its axis.",
  "Octopus arms can independently taste and move without direction from the brain.",
  "The world’s largest spider by leg span, the giant huntsman, can reach up to 30 cm.",
  "Wombat feces are cube-shaped to prevent them from rolling away and mark their territory.",
  "There are more possible iterations of a game of chess than atoms in the known universe.",
  "The shortest commercial flight in the world lasts just 57 seconds (Scotland’s Westray to Papa Westray).",
  "Sea cucumbers can eject their internal organs to deter predators, then regrow them.",
  "A teaspoon of neutron star material would weigh about 6 billion tons on Earth.",
  "Camels have three eyelids and two rows of eyelashes to protect their eyes from sand.",
  "The longest fossilized tree trunks ever discovered are over 10 m long.",
  "Starfish can regenerate entire limbs—and sometimes an entire body from a single arm.",
  "A bolt of lightning can reach temperatures of about 30 000 °C—five times hotter than the Sun’s surface.",
  "Humans and giraffes have the same number of vertebrae in their necks: seven.",
  "A group of owls is called a parliament.",
  "Alaska is simultaneously the westernmost, northernmost, and easternmost state in the U.S.",
  "Honeybees can recognize human faces in tests similar to those used on humans.",
  "A single honeybee will produce only about 1/12th of a teaspoon of honey in its lifetime.",
  "Kangaroos can’t walk backwards.",
  "Venus is hotter than Mercury, even though Mercury is closer to the Sun.",
  "Some turtles can breathe through their butts during hibernation.",
  "A flash of lightning is five times hotter than the surface of the Sun.",
  "Octopuses have three hearts and blue blood.",
  "A group of porcupines is called a prickle.",
  "Jellyfish are 95 % water.",
  "Butterflies taste with their feet.",
  "Giraffes have no vocal cords.",
  "The Mona Lisa has no eyebrows—Leonardo Da Vinci never painted them on.",
  "A teaspoon of soil can contain more organisms than there are people on Earth.",
  "Sloths can hold their breath for up to 40 minutes under water.",
  "Ravens can mimic human speech and remember faces.",
  "Pineapples take about two years to grow to full size.",
  "A group of ferrets is called a business.",
  "The Earth’s core is as hot as the Sun’s surface, about 5 500 °C.",
  "A single strand of human hair can support up to 100 grams of weight.",
  "Polar bears have black skin under their fur to absorb more heat.",
  "A group of kangaroos is called a mob.",
  "Honey never spoils—archaeologists have eaten 3 000-year-old honey found in Egyptian tombs.",
  "Sea otters wrap themselves in kelp to keep from drifting apart underwater.",
  "The world’s largest flower, Rafflesia arnoldii, can grow over 1 meter across.",
  "Starfish have no brains or blood; they use seawater to pump nutrients.",
  "The unicorn is the national animal of Scotland.",
  "Frogs drink water through their skin, not their mouths.",
  "There is a species of frog that can freeze solid and thaw back to life.",
  "The word “lethologica” describes the state of not being able to remember a word.",
  "A group of eagles is called a convocation.",
  "The planet Mercury has wrinkles due to cooling of its core after solidifying.",
  "Bees can fly up to 25 km/h.",
  "Wolves are monogamous and mate for life.",
  "The first oranges were thought to be green when ripe.",
  "Sharks are older than trees by about 200 million years.",
  "The most expensive spice in the world by weight is saffron.",
  "A single lightning bolt contains enough energy to toast 100 000 slices of bread.",
  "The world’s oldest wooden wheel is over 5 000 years old.",
  "The largest living organism is a fungus in Oregon covering over 3.4 km².",
  "Humans and dolphins are the only species known to recognize themselves in mirrors.",
  "The Arctic Tern migrates farther than any other animal—up to 71 000 km a year.",
  "The longest recorded flight of a chicken is 13 seconds.",
  "Octopuses have been observed using coconut shells as portable shelters.",
  "A group of flamingos can be called both a flamboyance and a stand.",
  "Mercury’s orbit is shifting due to gravitational influences from other planets.",
  "A group of hippos is called a bloat.",
  "The first known contraceptive was crocodile dung, used by Egyptians in 2000 B.C.E.",
  "Butterflies can see ultraviolet light patterns on flowers invisible to humans.",
  "The Eiffel Tower was almost temporarily moved to Montreal in 1967.",
  "A baby puffin is called a puffling.",
  "Blue whales are the largest animals ever known to have lived on Earth.",
  "Lightning strikes Earth about 8 million times per day.",
  "The average person will walk the equivalent of five times around the Earth in their lifetime.",
  "There are more possible ways to shuffle a deck of cards than atoms on Earth.",
  "Humans and giraffes have the same number of neck vertebrae: seven.",
  "A leap year happens every four years except for years divisible by 100 unless they are also divisible by 400.",
  "An adult human body has approximately 37 trillion cells.",
  "You shed about 600,000 particles of skin every hour.",
  "A single bolt of lightning contains enough energy to power a small town.",
  "The hottest temperature ever recorded on Earth was 56.7 °C in Death Valley in 1913.",
  "The coldest natural temperature ever directly recorded was –89.2 °C at Vostok Station in Antarctica.",
  "The deepest known point in the ocean is the Mariana Trench at nearly 11,000 meters.",
  "Venus has more volcanoes than any other planet in the Solar System.",
  "Mercury has a massive iron core that generates a magnetic field.",
  "Earth is the only planet not named after a god.",
  "Mars has the tallest volcano in the Solar System, Olympus Mons.",
  "Saturn’s rings are made of countless small particles ranging from micrometers to meters in size.",
  "Jupiter’s Great Red Spot has been raging for at least 350 years.",
  "Uranus rotates on its side, making its seasons extreme.",
  "Neptune has the strongest winds in the Solar System, reaching up to 2,100 km/h.",
  "Pluto was reclassified from a planet to a dwarf planet in 2006.",
  "Eclipses occur when the Sun, Earth, and Moon align.",
  "A solar eclipse occurs when the Moon passes between Earth and the Sun.",
  "A lunar eclipse occurs when Earth passes between the Sun and the Moon.",
  "Halley’s Comet returns to Earth’s vicinity every 76 years.",
  "The International Space Station travels at about 28,000 km/h.",
  "A day on the ISS is about 90 minutes long.",
  "Astronauts grow about 2 inches taller in space due to spinal expansion.",
  "Space is not completely empty; it contains sparse hydrogen atoms.",
  "Mars has two tiny moons: Phobos and Deimos.",
  "The Sun accounts for 99.86% of the Solar System’s mass.",
  "The Moon is drifting away from Earth at about 3.8 cm per year.",
  "Sputnik 1, launched in 1957, was the first artificial satellite.",
  "The first woman in space was Valentina Tereshkova in 1963.",
  "The first human on the Moon was Neil Armstrong in 1969.",
  "Space travel can cause changes in eyeglass prescriptions for astronauts.",
  "The vacuum of space can cause bodily fluids to boil at body temperature.",
  "Sound cannot travel in space because there is no medium.",
  "Meteor showers occur when Earth passes through debris left by comets.",
  "Leonids meteor shower can leave trails for up to 30 minutes.",
  "A full moon appears slightly larger on the horizon due to an optical illusion.",
  "The blue color of Earth from space comes from light scattering by the atmosphere.",
  "Micrometeorites strike spacecraft and astronauts regularly.",
  "Living bacteria have been found in clouds at altitudes of up to 15 km.",
  "Mount Everest grows about 4 mm higher each year due to tectonic activity.",
  "The Pacific Ocean is larger than all of Earth's landmass combined.",
  "More people have been to space than have climbed Mount Everest.",
  "The Amazon rainforest produces about 20% of the world’s oxygen.",
  "The Great Barrier Reef is the world’s largest coral reef system.",
  "Coral reefs support about 25% of marine species.",
  "Bioluminescent creatures in the ocean produce their own light.",
  "The deepest freshwater lake, Baikal, contains about 20% of the world’s unfrozen freshwater.",
  "Lake Superior contains more fresh water than any other lake in the world by surface area.",
  "The Dead Sea is Earth’s lowest elevation on land, at about 430 meters below sea level.",
  "The Caspian Sea is the world’s largest inland body of water.",
  "Mount Kilimanjaro is the tallest free-standing mountain in the world.",
  "The Sahara Desert is the largest hot desert in the world.",
  "The Gobi Desert spans northern China and southern Mongolia.",
  "Antarctica is considered a desert, receiving less than 50 mm of precipitation annually at its center.",
  "The Amazon River has the largest discharge of any river in the world.",
  "Rivers carry nutrients that support ecosystems downstream.",
  "Bioluminescent plankton create blue waves on tropical beaches.",
  "Monarch butterflies migrate up to 4,800Â km to overwintering sites in Mexico.",
  "Salmon return to the exact river where they were born to spawn.",
  "Sea turtles have been navigating oceans for over 110 million years.",
  "Humpback whales have complex songs that change over time.",
  "Penguins can drink seawater because of special glands that filter salt.",
  "The Mariana Trench’s Challenger Deep is the world’s deepest known point.",
  "Some starfish species can clone themselves.",
  "Jellyfish blooms can disrupt marine ecosystems.",
  "Mangrove forests protect coastlines from erosion and storms.",
  "Coral bleaching occurs when symbiotic algae are expelled due to stress.",
  "The Great Pacific Garbage Patch is a massive area of marine debris.",
  "Barnacles can survive being frozen and thawed multiple times.",
  "Dolphins call each other by unique signature whistles.",
  "Orcas have distinctive dialects among different pods.",
  "A blue whale’s tongue can weigh as much as an elephant.",
  "Narwhal tusks are elongated teeth that can grow up to 3 meters long.",
  "Electric eels use electrolocation to navigate murky waters.",
  "The axolotl is a salamander that remains in its juvenile form all its life.",
  "Some amphibians can survive being frozen solid.",
  "The lungfish can breathe air when water levels drop.",
  "Komodo dragons have venom glands in their saliva.",
  "Bats are the only flying mammals.",
  "Flying fish can glide over 200 meters to escape predators.",
  "Sea snails called abalone have mother-of-pearl shells.",
  "Parasitic isopods can replace fish tongues after attaching to the fish’s mouth.",
  "Cuttlefish have three hearts and blue-green blood.",
  "A mantis shrimp has the fastest punch of any animal, accelerating like a bullet.",
  "Antarctic icebergs can be larger than small countries.",
  "Some fish can change sex based on environmental conditions.",
  "The ocean’s twilight zone hosts bioluminescent life forms.",
  "Hydrothermal vents support unique ecosystems independent of sunlight.",
  "The coelacanth was thought extinct until rediscovered in 1938.",
  "Leatherback turtles migrate over 10,000 km across oceans.",
  "The oyster is the only creature that creates pearls.",
  "Some sharks must keep swimming to breathe.",
  "The panther chameleon can change color using nanocrystals.",
  "The mudskipper can use its pectoral fins to walk on land.",
  "The fastest land animal is the cheetah, which can accelerate from 0 to 100 km/h in just 3 seconds.",
  "Phytoplankton in the oceans produce up to 80 % of the oxygen we breathe.",
  "A single teaspoon of honey represents the collective work of about 12 bees.",
  "The Amazon River discharges more water than the next seven largest rivers combined.",
  "Adult humans have fewer bones (206) than babies (around 270).",
  "The world’s longest mountain range is underwater: the Mid-Ocean Ridge stretches over 65 000 km.",
  "Blue whales are the largest animals ever known, reaching up to 30 m in length.",
  "The human stomach lining renews itself every three to four days.",
  "Venus is the only planet that spins clockwise on its axis.",
  "Jupiter’s Great Red Spot is a storm larger than Earth that’s been raging for at least 350 years.",
  "A bolt of lightning can heat the air around it to 30 000 °C—five times hotter than the Sun’s surface.",
  "Saturn’s rings are made of ice and rock particles and are less than 100 m thick in places.",
  "Mercury has no atmosphere, so its surface temperature swings from –173 °C at night to 427 °C by day.",
  "Earth is the only planet not named after a god.",
  "Mars has the tallest volcano in the solar system, Olympus Mons, at about 22 km high.",
  "The Pacific Ocean covers more area than all Earth’s landmasses combined.",
  "Lake Baikal in Russia is the deepest freshwater lake, plunging to 1 642 m.",
  "The Sahara Desert is expanding southward at around 0.8 km per year.",
  "A group of flamingos is called a flamboyance.",
  "Honey never spoils—archaeologists have eaten 3 000-year-old honey found in Egyptian tombs.",
  "Jellyfish have existed for over 500 million years, before dinosaurs roamed Earth.",
  "The average human brain generates about 20 watts of electrical power while awake.",
  "Your nose can detect over 1 trillion different scents.",
  "Polar bears have black skin under their transparent fur to absorb heat.",
  "A pineapple is actually a collection of hundreds of individual berries fused together.",
  "Bamboo is the fastest-growing woody plant, reaching up to 1 m per day.",
  "Octopuses have three hearts and blue blood.",
  "Sloths only defecate about once a week—and climb down from trees to do it.",
  "The world’s oldest known wooden wheel is over 5 000 years old.",
  "A single cloud can weigh more than 1 million pounds.",
  "The Eiffel Tower was almost dismantled in 1909 but was saved because it proved useful as a radio antenna.",
  "Bananas are naturally radioactive due to their potassium-40 content.",
  "Scotland’s national animal is the unicorn.",
  "A flock of crows is called a murder.",
  "The first programmable computer was invented by Konrad Zuse in 1941.",
  "Saturn has at least 82 moons, more than any other planet.",
  "A group of hippos is called a bloat.",
  "Venus’s atmosphere is 96 % carbon dioxide, causing a runaway greenhouse effect.",
  "The Moon is drifting away from Earth at about 3.8 cm per year.",
  "An adult blue whale’s tongue can weigh as much as an elephant.",
  "The human heart beats around 100 000 times per day.",
  "A snail can sleep for up to three years during periods of drought.",
  "Some mushrooms can glow in the dark, a phenomenon called bioluminescence.",
  "The Great Barrier Reef can be seen from space.",
  "Lightning strikes Earth about 8 million times per day.",
  "The unicorn is the national animal of Scotland.",
  "Kangaroos can’t walk backwards.",
  "A group of unicorns is called a blessing.",
  "The coelacanth was thought extinct until rediscovered in 1938.",
  "Honeybees can recognize human faces.",
  "A group of frogs is called an army.",
  "The giant Pacific octopus can have an arm span of up to 9 m.",
  "Reindeer eyes change color based on the season to improve vision.",
  "Dolphins sleep with one half of their brain at a time.",
  "The first webcam was used at Cambridge University to monitor a coffee pot.",
  "Oxford University is older than the Aztec Empire by nearly 200 years.",
  "Giraffes have no vocal cords.",
  "The world’s largest snowflake was recorded at 15 inches wide.",
  "Bees have five eyes: two compound and three simple.",
  "The total length of all blood vessels in the human body is about 100 000 km.",
  "A group of ferrets is called a business.",
  "The bamboo lemur eats leaves so toxic that they can kill other animals.",
  "Mercury’s core makes up about 85 % of the planet’s radius.",
  "A bolt of lightning contains enough energy to power 200 000 homes for one second.",
  "Venus’s day (one rotation) is longer than its year (one orbit).",
  "Recycling one ton of paper saves 17 trees and 26 000 L of water.",
  "The world’s oldest living tree is over 5 000 years old in Sweden.",
  "The Amazon rainforest produces about 20 % of Earth’s oxygen.",
  "Sharks are older than trees by about 200 million years.",
  "Tigers have striped skin, not just striped fur.",
  "Polar bear fur is transparent, letting sunlight reach their black skin.",
  "Peanuts are not nuts but legumes related to beans and peas.",
  "A bolt from the blue is when a lightning strike comes from a clear sky.",
  "Adult humans have approximately 2 to 5 million sweat glands.",
  "The Eiffel Tower leans about 7 inches away from the sun during hot days.",
  "Some bamboo species can grow nearly 1 meter in just 24 hours.",
  "A single teaspoon of neutron star material would weigh about 6 billion tons on Earth.",
  "A cockroach can live for weeks without its head.",
  "Chocolate was once used as currency by the Aztecs.",
  "The world’s deepest postbox is in Susami Bay, Japan, at 10 m underwater.",
  "Mobile phones have more computing power than the computers that landed Apollo 11 on the Moon.",
  "The human eye can distinguish about 10 million different colors.",
  "Hot water can freeze faster than cold water under certain conditions, called the Mpemba effect.",
  "A group of whales is called a pod.",
  "The first animal in space was a dog named Laika, aboard Sputnik 2 in 1957.",
  "Octopus arms can taste because they have taste receptors along their suckers.",
  "A day on Neptune lasts 16 hours.",
  "Australia’s wombats produce cube-shaped droppings so they don’t roll away.",
"The quokka on Rottnest Island is nicknamed the world’s happiest animal for its natural smile.",
"The Great Barrier Reef is the planet’s largest living structure and is visible from space.",
"Tasmania’s Cape Grim baseline station records some of the cleanest air on Earth.",
"Lake Hillier in Western Australia stays bubble-gum pink all year, even when bottled.",
"A single bunya pine cone can weigh over 10 kg and hold 100 edible nuts.",
"Uluru’s colour changes from ochre to fiery red at sunrise and sunset due to iron oxidation.",
"The platypus closes its eyes, ears and nostrils underwater but can still hunt using electroreception.",
"Male seahorses in Australian waters carry developing young in a brood pouch and give birth.",
"Sydney’s Taronga Zoo once hatched a tree frog embryo frozen in liquid nitrogen—earning the nickname “Lazarus frog.”",
"Australia has more venomous than non-venomous snake species, yet fatal bites are extremely rare.",
"The dingo fence stretches about 5 600 km—longer than the Great Wall of China.",
"A koala’s fingerprints are so human-like they can confuse crime-scene investigators.",
"The southern cassowary can kick hard enough to disembowel a threat with its dagger-like claw.",
"Fairy penguins on Phillip Island parade home at dusk, delighting nightly crowds since the 1920s.",
"The inland taipan’s venom is the most toxic of any snake, yet it is shy and seldom encountered.",
"Lake Eyre can transform from salt pan to Australia’s largest lake after rare floods.",
"Fraser Island’s dingo population is one of the purest genetic lines left in Australia.",
"Quokkas can climb small trees and shrubs to reach fresh leaves during dry seasons.",
"The Tasmanian devil’s bite exerts more force relative to body size than any other carnivorous mammal.",
"Western Australia’s Wave Rock was sculpted over 2.7 billion years of wind and water erosion.",
"Some Australian eucalyptus trees release flammable oils, making their own bark ignite more readily in fires.",
"The sugar glider can glide over 50 m between trees using its skin membrane, the patagium.",
"Australian firehawks—black kites and brown falcons—carry burning sticks to start new fires and flush prey.",
"The Sydney funnel-web spider can survive for days underwater by trapping an air bubble against its abdomen.",
"Australia’s night parrot was thought extinct for 75 years until rediscovered in 2013.",
"Cane toads were introduced in 1935 and now cover more than one-third of Australia’s landmass.",
"The luminescent ghost fungus glows green in Aussie forests after heavy rain.",
"Arnhem Land’s ancient rock art galleries contain images of long-extinct megafauna like the thylacoleo.",
"Opal is Australia’s national gemstone; the country supplies about 90 % of the world’s precious opal.",
"The Pinnacles Desert features thousands of limestone pillars rising like stone forests from yellow sand.",
"The male lyrebird can mimic chainsaws, car alarms and camera shutters with incredible accuracy.",
"Broome’s “Staircase to the Moon” is a moonlit optical illusion created by tidal flats reflecting moonrise.",
"In Kakadu’s Wet Season, magpie geese build floating nests anchored to water-lilies.",
"Ningaloo Reef hosts the world’s largest predictable aggregation of whale sharks every autumn.",
"The kaluta, a tiny desert marsupial, engages in a frantic two-week mating season then the males die.",
"Australia’s oldest fossil stromatolites in the Pilbara are about 3.5 billion years old.",
"Gouldian finches choose mates with different head colours to boost offspring immunity.",
"Some outback frogs aestivate by encasing themselves in cocoons underground until rains return.",
"Saltwater crocodiles can swim over 30 km h and have been tracked crossing open ocean between rivers.",
"The Australian lungfish breathes air with a single lung and barely changed since the Devonian era.",
"Queensland’s Atherton Tablelands glow with blue flashes from the world’s largest bioluminescent fungus, Mycena chlorophos.",
"The giant cuttlefish mass-spawning at Whyalla is the only known congregation of its size worldwide.",
"Kangaroos and emus can’t walk backwards, one reason they appear on Australia’s coat of arms.",
"The desert landscape of Munga-Thirri (Simpson Desert) holds the longest parallel sand-dune system on Earth.",
"Wallabies have been documented scaling 35-m sea cliffs on Kangaroo Island to graze on cliff-top grass.",
"Rainbow lorikeets have specialized brush-shaped tongues for feeding on nectar and pollen.",
"The echidna’s tongue can flick in and out 100 times per minute to lap up ants and termites.",
"Mount Kosciuszko’s summit once hosted Australia’s only ski lift accessible by walking instead of roads.",
"The Australian Alps receive more annual snowfall than Switzerland’s Swiss Alps.",
"A single jar of Vegemite contains extract from around 250 g of brewer’s yeast.",
"Melbourne’s shoreline penguins nest under the rocks of a breakwater just metres from city lights.",
"Queensland’s Glass House Mountains are ancient volcanic plugs formed about 26 million years ago.",
"The sapphire quail-dove, once native to Queensland, is now found only in New Guinea.",
"Mining in Coober Pedy is mostly done underground to escape outback heat; many residents live in dugouts.",
"The Yarra River once held colonies of platypuses even within 5 km of Melbourne’s CBD.",
"The orange-bellied parrot migrates 4 000 km annually between Tasmania and Victoria’s saltmarshes.",
"Scientists recovered living bacteria from 40 000-year-old Tasmanian cave ice cores.",
"Perth is the most isolated capital city on a continent—nearest city Adelaide is 2 130 km away.",
"The Nullarbor Plain is the world’s largest single, treeless limestone karst landscape.",
"Australian giant dragonflies (Petalura ingentissima) can have wingspans over 16 cm.",
"Willie wagtails sometimes steal hair directly from live kangaroos to line their nests.",
"The world’s longest golf course, Nullarbor Links, stretches 1 365 km with each hole in a different town.",
"The world’s largest monolith by bulk is actually Mount Augustus, twice the size of Uluru.",
"Darwin hosts the Beer Can Regatta, where boats are built entirely from recycled cans.",
"In the Daintree Rainforest, prehistoric spiny plants called cycads date back 200 million years.",
"Australia’s oldest tree, the Huon pine, can sprout new trunks from roots over 3 000 years old.",
"Sapphire Coast stingrays willingly ‘hug’ snorkelers at Merimbula Wharf for fish scraps.",
"Aboriginal fire-stick farming created mosaic landscapes that boosted kangaroo grazing pasture.",
"The Tasmanian blue gum can shoot seeds over 100 m during bushfires as capsules explode.",
"Bilbies have big ears that act as radiators to keep them cool in desert heat.",
"Sea turtles on Heron Island use Earth’s magnetic field imprint to return decades later.",
"The beach-hopping sanderlings of Victoria can double their body weight before Arctic migration.",
"Australia is the driest inhabited continent, yet hosts rainforests older than the Amazon.",
"Gippsland’s “floating” peat mines can smoulder underground for months after bushfire fronts pass.",
"Shells of the giant eastern mussel have growth rings that archive La Niña and El Niño cycles.",
"South Australia’s Lake Bumbunga changes from pink to white depending on salinity and algae blooms.",
"Whale song from east-coast humpbacks can travel over 3 000 km and reach WA receivers.",
"The boom of the Australian bittern is so low-pitched it can be felt through wetland mud.",
"Sydney’s floating seawall tiles now host twice the invertebrate diversity of plain concrete walls.",
"The Marsupial lion’s retractable thumb-claw left tree-trunk scratch marks still visible in fossils.",
"Before decimalisation, Australia used the world’s only duodecimal pound currency apart from the UK.",
"Australia’s Snowy Mountains hydro scheme moved enough rock to fill the Great Pyramid of Giza seven times.",
"The Southern Cross constellation appears on Australia’s flag and is visible every clear night nationwide.",
"Lightning Ridge’s black opals display every spectral colour due to silica spheres arranged in a 3-D lattice.",
"The koala’s diet of toxic eucalyptus leaves requires a specialised gut microbe community inherited from mum’s pap.",
"Antechinus males mate continuously until stress hormones cause total organ failure shortly after breeding.",
"Australian water spiders build air-filled silk bubbles so they can hunt underwater for 24 hours straight.",
"Victorian fairy circles—bare soil rings—are made by subterranean termites creating ventilation shafts.",
"Spinifex hopping mice can survive without drinking water, deriving moisture entirely from seed metabolism.",
"The world’s first recorded surfing contest was held at Sydney’s Manly Beach in 1915 by Hawaiian Duke Kahanamoku.",
"Rainbow eucalyptus bark peels in strips, revealing bright green, red and purple ‘painted’ trunks.",
"The ghost bat is Australia’s only carnivorous bat large enough to prey on other bats.",
"Brisbane’s Story Bridge used 1.25 million rivets—fewer than half of Sydney Harbour Bridge.",
"Pancake Creek’s coral spawned six nights later than reefs 50 km north, revealing local lunar timing differences.",
"The Thorny devil can drink through capillary grooves in its skin that channel dew to its mouth.",
"Echidnas blow mucus bubbles on their snouts to keep them moist and cool in hot weather.",
"The Australian magpie can remember human faces for years and may selectively swoop certain individuals.",
"Bouncing ‘fairy circles’ in WA’s desert sands are created by termite grazing patterns, not vegetation gaps.",
"Victoria’s basalt plains formed the third-largest lava field on Earth, after India’s Deccan and Siberia’s traps.",
"Australia’s oldest bridge, Ross Bridge in Tasmania, was built by convicts in 1836 and still carries traffic.",
"Some bald-faced spoonbills in NSW use tools, flicking sticks to stir up mud-flats for hidden prey.",
"The southern boobook owl’s call rate can forecast rainfall changes two weeks ahead.",
"Leafy seadragons off SA can change colour to match surrounding kelp during courtship.",
"A bolt of lightning can reach temperatures of 30 000 °C, five times hotter than the sun’s surface.",
"Venus rotates clockwise, opposite to most planets in our solar system.",
"Sharks existed before trees; sharks are over 400 million years old, trees about 385 million.",
"The heart of a blue whale can weigh as much as a small car.",
"The Eiffel Tower grows about 15 cm taller in summer heat due to thermal expansion of iron.",
"Honey never spoils—edible 3,000-year-old pots were found in Egyptian tombs.",
"A day on Mercury lasts about 59 Earth days.",
"Octopuses have three hearts and blue, copper-based blood.",
"The fingerprints of a koala are almost indistinguishable from human prints under a microscope.",
"Lightning strikes Earth roughly 8 million times per day.",
"No two snowflakes are exactly alike because of countless micro-scale molecular arrangements.",
"A single strand of human DNA stretched out is about two metres long.",
"About 20 % of Earth’s oxygen is produced by the Amazon rainforest.",
"Saturn could theoretically float in water because its average density is lower than water’s.",
"Glass is actually a very slow-moving liquid; old cathedral windows are thicker at the bottom.",
"The shortest war in history was between Britain and Zanzibar in 1896 and lasted 38 minutes.",
"Polar bear fur is transparent; it looks white because it scatters visible light.",
"Some turtles can breathe through their cloaca when submerged for long periods.",
"The world’s deepest postbox sits 10 m under water in Susami Bay, Japan.",
"A cloud can weigh more than a million kilograms.",
"The longest recorded flight of a chicken is 13 seconds.",
"The tongue of a giraffe can be up to 50 cm long and is dark purple to prevent sunburn.",
"Orchids can live entirely underground, never seeing sunlight, by parasitising fungi.",
"Human saliva contains a painkiller called opiorphin six times stronger than morphine.",
"The first computer mouse was made of wood in 1964.",
"Antarctica is the driest, coldest and windiest continent, technically the world’s largest desert.",
"The unicorn is Scotland’s official national animal.",
"Cleopatra lived closer to the moon landing than to the construction of the Great Pyramid.",
"Dragonflies can accelerate to nearly 50 km/h and change direction mid-flight in milliseconds.",
"Jupiter’s Great Red Spot is a storm wider than Earth and has raged for at least 350 years.",
"Peanuts are not nuts; botanically they are legumes.",
"Neutron stars can spin 700 times per second and pack more mass than the Sun into a city-sized sphere.",
"The smell of freshly cut grass is actually a plant distress call.",
"The stinging cells of a box jellyfish fire venomous harpoons in under four microseconds.",
"Blue eyes evolved only about 6,000–10,000 years ago and all blue-eyed people share a common ancestor.",
"The shortest grammatically correct sentence in English is “Go.”",
"Vending machines kill more people annually than sharks do.",
"The “Mona Lisa” has no clearly visible eyebrows or eyelashes.",
"A day on Pluto is 6.4 Earth days long.",
"Bananas are radioactive due to their potassium-40 content.",
"Some frogs can survive being frozen solid and thaw back to life in spring.",
"A single honeybee will make about one-twelfth of a teaspoon of honey in its lifetime.",
"An octopus can taste with its arms because suckers contain chemoreceptors.",
"The only letter not appearing on the periodic table is J.",
"There are more possible iterations of a game of chess than atoms in the observable universe.",
"The world’s oldest known living organism is a 9,550-year-old spruce in Sweden named Old Tjikko.",
"Sound travels four times faster in water than in air.",
"The original London Bridge is now in Lake Havasu City, Arizona, USA.",
"Hot water can freeze faster than cold water in certain conditions—called the Mpemba effect.",
"A bolt of lightning is five times hotter than the surface of the Sun.",
"Cats have fewer toes on their back paws (four) than on their front paws (five).",
"Venus has sulfuric-acid rain that evaporates before reaching the surface.",
"The plastic ends of shoelaces are called aglets.",
"A day on Earth used to be only 18 hours long 1.4 billion years ago.",
"Oxford University is older than the Aztec Empire.",
"The Chance-Vought F4U Corsair airplane has asymmetrical wings to improve visibility while landing on carriers.",
"The scent of rain on dry soil is called petrichor.",
"Some metals, like gallium, melt in your hand because they liquefy at 29.8 °C.",
"Butterflies taste with sensors on their feet.",
"Humans share about 60 % of their DNA with bananas.",
"An ostrich’s eye is bigger than its brain.",
"Seahorses are the only animals in which the male becomes pregnant.",
"Banging your head against a wall for one hour burns about 150 calories — but is not recommended.",
"Space smells like seared steak to returning astronauts due to high-energy ion interactions.",
"Earth’s core is as hot as the surface of the Sun, around 5,400 °C.",
"New Zealand has more species of penguins than any other country.",
"An adult human has fewer bones than a baby; many infant bones fuse together as they grow.",
"Ravens can imitate human speech as well as, and sometimes better than, parrots.",
"Jellyfish have existed for over 500 million years, predating dinosaurs and trees.",
"The fingerprints of a chimpanzee are so similar to humans that they can fool forensic scientists.",
"Venus’s atmospheric pressure is about 92 times that of Earth, equivalent to being 900 m underwater.",
"The Milky Way is on a collision course with the Andromeda galaxy, expected in about 4 billion years.",
"Carrots were originally purple; orange varieties were bred in the 17th-century Netherlands.",
"The longest place name in the world, 85 letters long, is a hill in New Zealand: Taumatawhakatangihangakoauauotamateapokaiwhenuakitanatahu.",
"The Sun makes up 99.86 % of the mass in our solar system.",
"Bees can sense Earth’s magnetic field and use it for orientation inside dark hives.",
"Bubble wrap was invented in 1957 as a textured wallpaper.",
"Some lizards can squirt blood from their eyes as a defense mechanism.",
"The average cumulus cloud contains enough water to fill about 80 Olympic swimming pools.",
"Cleopatra’s favourite perfume, Mendesian, was recreated in 2019 from residue in an ancient jar.",
"Electric eels can deliver shocks of up to 860 volts.",
"Your taste buds are replaced every 10 to 14 days.",
"The strongest muscle in the human body by weight is the masseter (jaw muscle).",
"Spider silk is stronger than steel by weight.",
"The world’s largest living organism is a honey fungus in Oregon covering 9 km² underground.",
"Mars has the largest volcano in the solar system, Olympus Mons, nearly three times Everest’s height.",
"The word “robot” comes from the Czech word “robota,” meaning forced labor.",
"A swarm of 20,000 bees followed a car for two days because their queen was trapped inside.",
"Dolphins have individual names communicated through signature whistles.",
"The deepest part of the ocean, Challenger Deep, is about 11 km below sea level.",
"Koalas have fingerprints so similar to humans they could taint crime scenes—true twice over for emphasis!",
"The hummingbird is the only bird that can fly backward.",
"A mantis shrimp can accelerate its claw faster than a .22-calibre bullet exits a gun.",
"The shortest commercial flight is 2 minutes between Westray and Papa Westray in Scotland’s Orkney Islands.",
"Some metals, like sodium, explode on contact with water due to violent exothermic reactions.",
"A day on Uranus lasts 17 Earth hours, but its axial tilt is 98°, so it “rolls” around the Sun.",
"A teaspoon of a neutron star would weigh about 4 billion tons on Earth.",
"Pineapples were such status symbols in 18th-century Europe that people rented them for parties.",
"A group of flamingos is called a flamboyance.",
"Vultures can safely digest anthrax bacteria lethal to most animals.",
"The dot over a lowercase i or j is called a tittle.",
"Water can boil and freeze simultaneously in a vacuum—called the triple point.",
"The Greenland shark can live over 400 years, making it the longest-lived vertebrate.",
"Cats can make about 100 different vocal sounds; dogs can make roughly 10.",
"NASA’s spacesuits cost an estimated US$12 million each.",
"Fingernails grow faster on your dominant hand.",
"Shakespeare invented over 1,700 English words, including “eyeball,” “fashionable,” and “lonely.”",
"Elephants can’t jump—all other mammals can.",
"The odds of shuffling a deck of cards into any exact order that has ever existed before are practically zero.",
"The voice of Mario in Nintendo games, Charles Martinet, also voices Luigi, Wario and Waluigi.",
"Some astronauts grow up to 5 cm taller in space due to spinal decompression.",
"McDonald’s once made bubblegum-flavored broccoli to encourage kids to eat vegetables.",
"Humans are the only animals that blush.",
"A flock of crows is called a murder.",
"Rain contains vitamin B12, produced by certain microbes in the atmosphere.",
"Octopus ink not only obscures vision but also dulls a predator’s sense of smell.",
"The average person walks the equivalent of three times around the world in a lifetime.",
"Sloths can hold their breath longer than dolphins—up to 40 minutes.",
"A day on Earth’s Moon lasts about 29.5 Earth days (one lunar phase cycle).",
"One bolt of lightning carries enough energy to toast about 100,000 slices of bread.",
"More people visit Paris’s Notre-Dame Cathedral each year than the Eiffel Tower.",
"Whale sharks have skin up to 10 cm thick, the thickest of any living creature.",
"The largest snowflake on record, according to 1887 reports, was 38 cm wide.",
"Camera shutters sound louder in movies because sound designers add artificial clicks.",
"The human nose can detect about one trillion different odors.",
"Oysters can change sex multiple times during their life cycle.",
"The Sahara Desert was once a lush region with rivers and hippos 6,000 years ago.",
"The word “laser” is an acronym for Light Amplification by Stimulated Emission of Radiation."
]
